<?php
// +----------------------------------------------------------------------
// 缓存配置文件
// +----------------------------------------------------------------------
// 请勿使用记事本编辑！
// +----------------------------------------------------------------------

// 缓存驱动（使用哪种缓存）
/* 可以填写下列值：
警告：必须保持大小写一致，否则会导致不可预测的错误
Apc
Memcache
Memcached
Predis
Redis
Filesystem （注：直接存到文件里，需要允许写入）
 */
define('CacheDriver', 'Redis');

// 缓存服务器地址
// 使用Filesystem时，表示存储目录
define('CacheHost', '127.0.0.1');

// 缓存服务器端口
// 使用Filesystem时无需填写
// Redis 默认端口号为 6379
define('CachePort', '6379');

// 缓存前缀
define('CachePrefix', 'comm_');